### Notebook to view and add data. Also for testing scripts

In [42]:
import psycopg2
conn = psycopg2.connect("dbname=postgres user=zmckee host=cs425.cc0vhnbhtoib.us-east-2.rds.amazonaws.com ")

In [43]:
%load_ext sql
%sql postgresql://zmckee:K?JQRD5<G>TV8CX:A8;G@cs425.cc0vhnbhtoib.us-east-2.rds.amazonaws.com/postgres

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: zmckee@postgres_1'

In [39]:
%%sql

SELECT table_name FROM information_schema.tables WHERE table_schema='public'

8 rows affected.

[('booking',),
 ('booking_flight',),
 ('airline',),
 ('customer',),
 ('flight',),
 ('airport',),
 ('address',),
 ('creditcard',)]

In [92]:
%%sql

DROP TABLE booking_flight;

CREATE TABLE booking_flight(
    bookingID INTEGER,
    airline_code VARCHAR(2),
    flight_number NUMERIC,
    flight_date	 DATE,
    seats NUMERIC, 
    FOREIGN KEY (bookingID) REFERENCES booking (id),
    FOREIGN KEY	(airline_code,flight_number,flight_date) REFERENCES flight(airline_code,flight_number,flight_date)
);

Done.
Done.

[]

In [44]:
%%sql

CREATE TABLE booking(
    id SERIAL NOT NULL PRIMARY KEY,
    class VARCHAR,
    paymentCard NUMERIC,
    user_ VARCHAR,
    FOREIGN KEY (user_) REFERENCES customer (email), 
    FOREIGN KEY (paymentCard) REFERENCES creditCard(number)
);



CREATE TABLE booking_flight(
    bookingID INTEGER,
    airline_code VARCHAR(2),
    flight_number NUMERIC,
    flight_date	 DATE,
    FOREIGN KEY (bookingID) REFERENCES booking (id),
    FOREIGN KEY	(airline_code,flight_number,flight_date) REFERENCES flight(airline_code,flight_number,flight_date)
);

(psycopg2.ProgrammingError) relation "booking" already exists
 [SQL: 'CREATE TABLE booking(\n    id SERIAL NOT NULL PRIMARY KEY,\n    class VARCHAR,\n    paymentCard NUMERIC,\n    user_ VARCHAR,\n    FOREIGN KEY (user_) REFERENCES customer (email), \n    FOREIGN KEY (paymentCard) REFERENCES creditCard(number)\n);']

In [88]:
%%sql

INSERT INTO flight VALUES 
('AA', 101, '2017-12-31', 'JFK', 'LAX', '03:00:00', '9:25:00', 15, 250, 600, 1200), 
('AA', 102, '2017-12-31', 'JFK', 'ORD', '03:00:00', '5:15:00', 15, 250, 100, 200), 
('AA', 103, '2017-12-31', 'JFK', 'DEN', '03:00:00', '7:00:00', 15, 250, 300, 600), 
('AA', 104, '2017-12-31', 'ORD', 'LAX', '06:00:00', '10:30:00', 15, 250, 300, 600), 
('AA', 105, '2017-12-31', 'ORD', 'DEN', '06:00:00', '8:45:00', 15, 250, 100, 200), 
('AA', 106, '2017-12-31', 'DEN', 'LAX', '09:30:00', '12:15:00', 15, 250, 100, 200)

6 rows affected.

[]

In [91]:
%%sql

WITH RECURSIVE connections(f_codes, frm, dest, hops, price, airtime, arrival) AS (
  SELECT    airline_code || flight_number::text AS f_codes,
            depart_loc, 
            dest_loc,
            1 AS hops, 
            fc_price AS price,
            (arrival_time - depart_time) AS airtime,
            arrival_time
  FROM flight f0
  WHERE depart_loc = 'JFK' 
  UNION ALL
  SELECT con.f_codes || '-' || f1.airline_code || f1.flight_number::text as flight
            , con.frm
            , f1.dest_loc
            , con.hops + 1 AS hops
            , con.price + f1.fc_price as price
            , (con.airtime + (f1.arrival_time - f1.depart_time)) AS total_time
            , f1.arrival_time
  FROM connections con
     JOIN flight f1
       ON f1.depart_loc = con.dest
       AND f1.depart_time > con.arrival 
)
SELECT *
FROM connections
WHERE dest = 'LAX'

4 rows affected.

[('AA101', 'JFK', 'LAX', 1, Decimal('600'), datetime.timedelta(0, 23100), datetime.time(9, 25)),
 ('AA102-AA104', 'JFK', 'LAX', 2, Decimal('400'), datetime.timedelta(0, 24300), datetime.time(10, 30)),
 ('AA103-AA106', 'JFK', 'LAX', 2, Decimal('400'), datetime.timedelta(0, 24300), datetime.time(12, 15)),
 ('AA102-AA105-AA106', 'JFK', 'LAX', 3, Decimal('300'), datetime.timedelta(0, 27900), datetime.time(12, 15))]

In [75]:
%%sql
SELECT (arrival_time - depart_time) from flight

9 rows affected.

[(datetime.timedelta(0, 10800),),
 (datetime.timedelta(0, 7020),),
 (datetime.timedelta(0, 3000),),
 (datetime.timedelta(0, 23100),),
 (datetime.timedelta(0, 8100),),
 (datetime.timedelta(0, 14400),),
 (datetime.timedelta(0, 16200),),
 (datetime.timedelta(0, 9900),),
 (datetime.timedelta(0, 9900),)]

In [89]:
%%sql
SELECT * from flight

9 rows affected.

[('AA', Decimal('1'), datetime.date(2017, 10, 31), 'ORD', 'SEA', datetime.time(5, 0), datetime.time(8, 0), Decimal('20'), Decimal('160'), Decimal('5000'), Decimal('280')),
 ('AA', Decimal('1330'), datetime.date(2017, 12, 26), 'ORD', 'CLT', datetime.time(18, 26), datetime.time(20, 23), None, Decimal('144'), Decimal('251'), Decimal('113')),
 ('AA', Decimal('5709'), datetime.date(2017, 12, 27), 'CLT', 'EWN', datetime.time(0, 5), datetime.time(0, 55), Decimal('9'), Decimal('56'), Decimal('200'), Decimal('105')),
 ('AA', Decimal('101'), datetime.date(2017, 12, 31), 'JFK', 'LAX', datetime.time(3, 0), datetime.time(9, 25), Decimal('15'), Decimal('250'), Decimal('600'), Decimal('1200')),
 ('AA', Decimal('102'), datetime.date(2017, 12, 31), 'JFK', 'ORD', datetime.time(3, 0), datetime.time(5, 15), Decimal('15'), Decimal('250'), Decimal('100'), Decimal('200')),
 ('AA', Decimal('103'), datetime.date(2017, 12, 31), 'JFK', 'DEN', datetime.time(3, 0), datetime.time(7, 0), Decimal('15'), Decimal('250'), Decimal('300'), Decimal('600')),
 ('AA', Decimal('104'), datetime.date(2017, 12, 31), 'ORD', 'LAX', datetime.time(6, 0), datetime.time(10, 30), Decimal('15'), Decimal('250'), Decimal('300'), Decimal('600')),
 ('AA', Decimal('105'), datetime.date(2017, 12, 31), 'ORD', 'DEN', datetime.time(6, 0), datetime.time(8, 45), Decimal('15'), Decimal('250'), Decimal('100'), Decimal('200')),
 ('AA', Decimal('106'), datetime.date(2017, 12, 31), 'DEN', 'LAX', datetime.time(9, 30), datetime.time(12, 15), Decimal('15'), Decimal('250'), Decimal('100'), Decimal('200'))]

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql